using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace BigRACE
{
    class Beach : IGame
    {

        public void PlayGame()
        {
            Console.WriteLine("Всего в конкурсе участвуют 7 атлетов. Задача команды по-одному спуститься на резиновой лодке в бассейн с водой и вместе с этой лодкой забраться на островок, причём, только первый участник имеет право держаться за трос в середине острова. Главная особенность в том, что с каждым прибывшим участником устоять на шатком острове становится всё сложнее. Победа присуждается той команде, у которой все 7 участников с лодками окажутся на острове за минимальное время.");
        }
    }
}
